convertigo-templates/lib_Salesforce/soap-templates/SoapBinding/Cmerge.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com" xmlns:urn1="urn:sobject.partner.soap.sforce.com">
   <soapenv:Header>
      <urn:EmailHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:triggerAutoResponseEmail>$(HEADER_EMAILHEADER_TRIGGERAUTORESPONSEEMAIL)</urn:triggerAutoResponseEmail>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:triggerOtherEmail>$(HEADER_EMAILHEADER_TRIGGEROTHEREMAIL)</urn:triggerOtherEmail>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:triggerUserEmail>$(HEADER_EMAILHEADER_TRIGGERUSEREMAIL)</urn:triggerUserEmail>
      </urn:EmailHeader>
      <urn:PackageVersionHeader>
         <!--Zero or more repetitions:-->
         <urn:packageVersions>
            <!--type: {http://www.w3.org/2001/XMLSchema}int-->
            <urn:majorNumber>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_MAJORNUMBER)</urn:majorNumber>
            <!--type: {http://www.w3.org/2001/XMLSchema}int-->
            <urn:minorNumber>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_MINORNUMBER)</urn:minorNumber>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:namespace>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_NAMESPACE)</urn:namespace>
         </urn:packageVersions>
      </urn:PackageVersionHeader>
      <urn:DebuggingHeader>
         <!--type: {urn:partner.soap.sforce.com}DebugLevel - enumeration: [None,DebugOnly,Db]-->
         <urn:debugLevel>$(HEADER_DEBUGGINGHEADER_DEBUGLEVEL)</urn:debugLevel>
      </urn:DebuggingHeader>
      <urn:StreamingEnabledHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:streamingEnabled>$(HEADER_STREAMINGENABLEDHEADER_STREAMINGENABLED)</urn:streamingEnabled>
      </urn:StreamingEnabledHeader>
      <urn:DisableFeedTrackingHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:disableFeedTracking>$(HEADER_DISABLEFEEDTRACKINGHEADER_DISABLEFEEDTRACKING)</urn:disableFeedTracking>
      </urn:DisableFeedTrackingHeader>
      <urn:AllowFieldTruncationHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:allowFieldTruncation>$(HEADER_ALLOWFIELDTRUNCATIONHEADER_ALLOWFIELDTRUNCATION)</urn:allowFieldTruncation>
      </urn:AllowFieldTruncationHeader>
      <urn:MruHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:updateMru>$(HEADER_MRUHEADER_UPDATEMRU)</urn:updateMru>
      </urn:MruHeader>
      <urn:AssignmentRuleHeader>
         <!--type: {urn:partner.soap.sforce.com}ID-->
         <urn:assignmentRuleId>$(HEADER_ASSIGNMENTRULEHEADER_ASSIGNMENTRULEID)</urn:assignmentRuleId>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:useDefaultRule>$(HEADER_ASSIGNMENTRULEHEADER_USEDEFAULTRULE)</urn:useDefaultRule>
      </urn:AssignmentRuleHeader>
      <urn:CallOptions>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:client>$(HEADER_CALLOPTIONS_CLIENT)</urn:client>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:defaultNamespace>$(HEADER_CALLOPTIONS_DEFAULTNAMESPACE)</urn:defaultNamespace>
      </urn:CallOptions>
      <urn:SessionHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:sessionId>$(HEADER_SESSIONHEADER_SESSIONID)</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:merge>
         <!--Zero or more repetitions:-->
         <urn:request>
            <urn:masterRecord>
               <!--type: {http://www.w3.org/2001/XMLSchema}string-->
               <urn1:type>$(BODY_MERGE_REQUEST_MASTERRECORD_TYPE)</urn1:type>
               <!--Zero or more repetitions:-->
               <!--type: {http://www.w3.org/2001/XMLSchema}string-->
               <urn1:fieldsToNull>$(BODY_MERGE_REQUEST_MASTERRECORD_FIELDSTONULL)</urn1:fieldsToNull>
               <!--type: {urn:partner.soap.sforce.com}ID-->
               <urn1:Id>$(BODY_MERGE_REQUEST_MASTERRECORD_ID)</urn1:Id>
               <!--You may enter ANY elements at this point-->
            </urn:masterRecord>
            <!--1 or more repetitions:-->
            <!--type: {urn:partner.soap.sforce.com}ID-->
            <urn:recordToMergeIds>$(BODY_MERGE_REQUEST_RECORDTOMERGEIDS)</urn:recordToMergeIds>
         </urn:request>
      </urn:merge>
   </soapenv:Body>
</soapenv:Envelope>